[
  {
    "section": "Title",
    "text": [
      "#I7:immcraft:textures/gui/title.png:0,0,64,64,64,64", "#",
      "##",
      "##",
      "#:3,white,center:The", "##", "#:3,white,center:ImmersiveCraft", "##", "#:3,white,center:Manual",
      "##",
      "#:1,white,italic,center:By McJty "
    ]
  },
  {
    "page": true
  },
  {
    "section": "TOC",
    "text": [
      "#:2:Table of Contents",
      "##",
      "#>", "#l:Using This Manual",
      "#>", "#l:Introduction",
      "#>", "#l:The World",
      "#>", "#l:Getting Fire",
      "#>", "#l:The Axe",
      "#>", "#l:Item Placement",
      "#>", "#l:The Blocks",
      "#>", "#l:Aqua Munda"
    ]
  },
  {
    "page": true
  },
  {
    "section": "Using This Manual",
    "text": [
      "#:2:Using This Manual",
      "##",
      "There are two ways that you can use this manual.",
      "You can use it simply by right clicking this book item (",
      "#i:immcraft:manual",
      ") and viewing it in a regular GUI",
      "or you can use it by placing the book in a bookstand (",
      "#i:immcraft:bookstand",
      ")."
    ]
  },
  {
    "text": [
      "If you use it in the bookstand you can interact with the book directly in the world."
    ]
  },
  {
    "text": [
      "You can right click on links to go to the corresponding page."
    ]
  },
  {
    "text": [
      "Right clicking the left border of the page will flip the page to the previous page."
    ]
  },
  {
    "text": [
      "Right clicking the right border of the page will flip to the next page."
    ]
  },
  {
    "text": [
      "Right clicking the top border will go navigate back to the cover page."
    ]
  },
  {
    "text": [
      "In the GUI you can also use the arrow left, right, backspace, space, or home keys to navigate."
    ]
  },
  {
    "text": [
      "Use sneak-rightclick on the book to remove it from the bookstand."
    ]
  },
  {
    "page": true
  },
  {
    "section": "Introduction",
    "text": [
      "#:2:Introduction",
      "##",
      "#:bold:ImmersiveCraft", "is a mod that tries to bring more immersion to the Minecraft world.",
      "It tries to avoid GUI's as much as possible and instead allows you to interact with machines directly by",
      "placing and removing items in handles."
    ]
  },
  {
    "text": [
      "Usage of", "#:italic:handles", "should be intuitive. In most cases you rightclick with the right item on a specific handle",
      "and if it is the right item it should fit in. If there is already an item there you can remove it."
    ]
  },
  {
    "page": true
  },
  {
    "section": "The World",
    "text": [
      "#:2:The World around You",
      "##",
      "The first thing you might have noticed when looking around you is the rocks (", "#i:immcraft:rock",
      ") and sticks (", "#i:minecraft:stick" ,") on the ground.",
      "Sticks are more likely to be found under trees and rocks you can usually find everywhere"
    ]
  },
  {
    "text": [
      "These items are very useful. Gather as many as you can."
    ]
  },
  {
    "text": [
      "Rocks can be thrown by right clicking them. This can be useful as an early game",
      "ranged weapon."
    ]
  },
  {
    "text": [
      "You can also place them back on the ground or use them for various crafting recipes"
    ]
  },
  {
    "text": [
      "Right clicking with a flint (", "#i:minecraft:flint", ") on a rock on the ground will create flint and steel (",
      "#i:minecraft:flint_and_steel", ")"
    ]
  },
  {
    "text": [
      "Sticks can be found in bundles. You can place sticks back in the world by right clicking them."
    ]
  },
  {
    "text": [
      "Breaking leaves is another way to gather sticks."
    ]
  },
  {
    "page": true
  },
  {
    "section": "Getting Fire",
    "text": [
      "#:2:Getting Fire",
      "##",
      "With sticks you can easily make fire."
    ]
  },
  {
    "text": [
      "Either place the sticks on the ground in a bundle and use a flint and steel (",
      "#i:minecraft:flint_and_steel", ") on them."
    ]
  },
  {
    "text": [
      "Or else place a rock on the floor and right click it with a stick.",
      "You may have to do this a number of times before it works."
    ]
  },
  {
    "text": [
      "A burning bundle of sticks will slowly use up the sticks.",
      "By right clicking new sticks you can make sure it keeps burning"
    ]
  },
  {
    "page": true
  },
  {
    "section": "The Axe",
    "text": [
      "#:2:The Axe",
      "##",
      "If you place a stick (", "#i:minecraft:stick",
      ") on the ground and right click it with a rock (",
      "#i:immcraft:rock", ") you get a stone axe (",
      "#i:minecraft:stone_axe", ")"
    ]
  },
  {
    "page": true
  },
  {
    "section": "Item Placement",
    "text": [
      "#:2:Item Placement",
      "##",
      "Any item can be placed on a wall or on a block if you want.",
      "This can be a faster way to access your tools or weapons.",
      "You can basically just pick them from the wall directly."
    ]
  },
  {
    "text": [
      "For tools this happens automatically if you right click them on a solid block",
      "(provided this feature is enabled in the config)."
    ]
  },
  {
    "text": [
      "Otherwise you can use the 'p' key (default placement key) to place an item on the block you want.",
      "Note that you can fit 4 items on a single block surface."
    ]
  },
  {
    "page": true
  },
  {
    "section": "The Blocks",
    "text": [
      "#:2:The Blocks",
      "##",
      "ImmersiveCraft has various blocks that you can use. All of them allow you to use them without having to access a GUI."
    ]
  },
  {
    "text": [
      "#i9:immcraft:bookstand", "#:2,vcenter,bold:Bookstand", "#",
      "The bookstand can hold a single manual (provided it supports this mod) and allows you to read it in-world.",
      "Just right click the book on the stand and sneak-right click to remove it again."
    ]
  },
  {
    "text": [
      "#i9:immcraft:chest", "#:2,vcenter,bold:Chest", "#",
      "This is a more immersive chest that can hold 12 stacks.",
      "You can open and close it and place items in it"
    ]
  },
  {
    "text": [
      "#i9:immcraft:furnace", "#:2,vcenter,bold:Furnace", "#",
      "This furnace works like a regular furnace. The only difference is that you need to ignite the fuel using flint and steel (",
      "#i:minecraft:flint_and_steel", ") before it will work"
    ]
  },
  {
    "text": [
      "#i9:immcraft:shelf", "#:2,vcenter,bold:Shelf", "#",
      "A shelf can hold 16 items. It works a bit like a chest except that it is wall mounted and does not have a lid to close it."
    ]
  },
  {
    "text": [
      "#i9:immcraft:cupboard", "#:2,vcenter,bold:Cupboard", "#",
      "A cupboard is exactly like a shelf but it can be closed."
    ]
  },
  {
    "text": [
      "#i9:immcraft:bookshelf", "#:2,vcenter,bold:Bookshelf", "#",
      "A bookshelf can be used to hold various types of books. It has room for 27 books."
    ]
  },
  {
    "page": true
  },
  {
    "section": "Aqua Munda",
    "text": [
      "#:2:Aqua Munda",
      "##",
      "This is another mod that greatly extends the immersive features.",
      "It adds water handling and cooking devices."
    ]
  }
]
